samples/expression_bdd_dot/all_operators.dot
digraph bdd {
  rankdir=TB;
  "node000" [label = "var1", name = "node000", shape = "circle", style = "filled"];
  "node001" [label = "var2", name = "node001", shape = "circle", style = "filled"];
  "node002" [label = "var3", name = "node002", shape = "circle", style = "filled"];
  "node003" [label = "var4", name = "node003", shape = "circle", style = "filled"];
  "node004" [label = "var4", name = "node004", shape = "circle", style = "filled"];
  "node005" [label = "var5", name = "node005", shape = "circle", style = "filled"];
  "node006" [label = "var5", name = "node006", shape = "circle", style = "filled"];
  "node007" [label = "var6", name = "node007", shape = "circle", style = "filled"];
  "node008" [label = "var6", name = "node008", shape = "circle", style = "filled"];
  "node009" [label = "var7", name = "node009", shape = "circle", style = "filled"];
  "node010" [label = "var7", name = "node010", shape = "circle", style = "filled"];
  "node011" [label = "0", fillcolor = "lightgray", name = "node011", shape = "box", style = "filled"];
  "node012" [label = "1", fillcolor = "lightgray", name = "node012", shape = "box", style = "filled"];
  "node000" -> "node001" [style = "solid"];
  "node000" -> "node002" [style = "dashed"];
  "node001" -> "node002" [style = "dashed"];
  "node001" -> "node003" [style = "solid"];
  "node002" -> "node003" [style = "dashed"];
  "node002" -> "node004" [style = "solid"];
  "node003" -> "node005" [style = "dashed"];
  "node003" -> "node007" [style = "solid"];
  "node004" -> "node006" [style = "dashed"];
  "node004" -> "node008" [style = "solid"];
  "node005" -> "node007" [style = "solid"];
  "node005" -> "node012" [style = "dashed"];
  "node006" -> "node008" [style = "solid"];
  "node006" -> "node011" [style = "dashed"];
  "node007" -> "node009" [style = "solid"];
  "node007" -> "node010" [style = "dashed"];
  "node008" -> "node009" [style = "dashed"];
  "node008" -> "node010" [style = "solid"];
  "node009" -> "node011" [style = "solid"];
  "node009" -> "node012" [style = "dashed"];
  "node010" -> "node011" [style = "dashed"];
  "node010" -> "node012" [style = "solid"];
}
